{
  "get_scene_info": "Get the current scene state.\n\n🔍 ESSENTIAL FIRST STEP: Always call this function BEFORE any other operations to understand what currently exists in the scene.\n\nReturns:\n- All nodes with their auto-generated IDs and positions\n- All members with their auto-generated IDs and connected nodes\n- All boundary conditions\n- All loads\n\nUse the returned IDs in subsequent operations - never assume or guess IDs.",
  "add_nodes": "Add nodes to the scene.\n\n⚠️ CRITICAL PREREQUISITE: You MUST call get_scene_info() FIRST to check existing nodes and understand the current scene state.\n\nIMPORTANT NOTES:\n- Y-axis is vertical (Y-up coordinate system)\n- Node IDs are AUTO-GENERATED by the system\n- After adding nodes, call get_scene_info() again to retrieve the generated IDs\n\nWORKFLOW:\n1. Call get_scene_info() to see existing nodes and avoid duplicates\n2. Add new nodes with this function\n3. Call get_scene_info() to get the auto-generated node IDs for use in subsequent operations",
  "add_members": "Add members to the scene.\n\n⚠️ CRITICAL PREREQUISITE: You MUST call get_scene_info() FIRST to retrieve the actual node IDs that exist in the scene. Never assume node IDs - they are auto-generated.\n\nWORKFLOW:\n1. Call get_scene_info() to see existing nodes\n2. Use the actual node.id values from the response for nodei and nodej parameters\n3. Then call this function with those IDs\n\nMember IDs are also AUTO-GENERATED. Call get_scene_info() after adding members to retrieve their IDs for use with loads.",
  "add_bc": "Apply boundary conditions to the nodes.\n\n⚠️ CRITICAL PREREQUISITE: You MUST call get_scene_info() FIRST to retrieve the actual node IDs that exist in the scene.\n\nWORKFLOW:\n1. Call get_scene_info() to see existing nodes\n2. Use the actual node.id values from the response for the targets parameter\n3. Then call this function with those node IDs\n\nNEVER use assumed or guessed node IDs - always get them from get_scene_info().",
  "add_linear_load": "Apply linear loads to the members.\n\n⚠️ CRITICAL PREREQUISITE: You MUST call get_scene_info() FIRST to retrieve the actual member IDs that exist in the scene.\n\nIMPORTANT NOTES:\n- Y-axis is vertical (Y-up coordinate system)\n- Member IDs are AUTO-GENERATED when members are created\n\nWORKFLOW:\n1. Call get_scene_info() to see existing members\n2. Use the actual member.id values from the response for the targets parameter\n3. Then call this function with those member IDs\n\nNEVER use assumed or guessed member IDs - always get them from get_scene_info()."
}